<?xml version="1.0"?>
<projects>
  <project>
    <app_version>0.3.0.9017</app_version>
    <unique_id>c3bf35d117ff5295193d34d93059d140051ec19bd6d140a866247571ced0c6ad</unique_id>
    <version>0.0.1.9000</version>
    <author>DAVY Florentin, DELANGE Boris </author>
    <name_en>D&#xE9;lai PTH</name_en>
    <name_fr>HIP Fracture delay </name_fr>
    <category_en></category_en>
    <category_fr></category_fr>
    <description_en></description_en>
    <description_fr>Fracture de l&#x2019;extr&#xE9;mit&#xE9; sup&#xE9;rieure du f&#xE9;mur (FESF) et anticoagulants oraux directs (AOD) : 
Evaluation de la mise en place d&#x2019;un protocole de prise en charge locale, exemple au Centre Hospitalier de Saint-Malo.

## Introduction

La FESF est un pathologie fr&#xE9;quente (&gt; 75 000 cas par an en France), touchant une population &#xE2;g&#xE9;e et est &#xE0; l&#x2019;origine d&#x2019;une mortalit&#xE9;, d&#x2019;une morbidit&#xE9; et d&#x2019;une perte d&#x2019;autonomie importante entrainant un cout important. Son incidence est en augmentation du fait d&#x2019;un vieillissement de la population. Tout ceci en fait un probl&#xE8;me majeur de sant&#xE9; publique. 
La pr&#xE9;valence de patient sous traitement anticoagulant est importante dans cette population g&#xE9;riatrique. On constate depuis 2012 et la mise sur le march&#xE9; des &#xAB; nouveaux &#xBB; anticoagulant oraux une forte augmentation de patient trait&#xE9; par ces m&#xE9;dicaments qui remplace les classiques AVK. 
De nombreuse &#xE9;tudes ont maintenant prouv&#xE9;s l&#x2019;importance d&#x2019;une chirurgie pr&#xE9;coce (&lt; 48h) pour r&#xE9;duire la morbi mortalit&#xE9; de ces fractures. Cependant la pr&#xE9;sence d&#x2019;un traitement anticoagulant pourrait allonger les d&#xE9;lais de prises en charges et augmenter la morbi-mortalit&#xE9;. 
Afin d&#x2019;uniformiser la prise en charge de ces patients et de r&#xE9;duire les d&#xE9;lais de prise en charge un protocole de service a &#xE9;t&#xE9; mis en place au CH de Saint Malo en Janvier 2023. 
L&#x2019;objectif principal est l&#x2019;&#xE9;valuation de la mise en place de ce protocole. L&#x2019;hypoth&#xE8;se formul&#xE9;e est que la mise en place d&#x2019;un protocole, permet d&#x2019;op&#xE9;rer les patients plus rapidement (dans un d&#xE9;lai inf&#xE9;rieur &#xE0; 48h).

## Mat&#xE9;riel et m&#xE9;thodes

Nous r&#xE9;alisons une &#xE9;tudes de cohorte r&#xE9;trospective, observationnelle, monocentrique. Le crit&#xE8;re de jugement principale est le d&#xE9;lai de prise en charge au bloc op&#xE9;ratoire apr&#xE8;s l&#x2019;admission des patients (en heures). 
Les crit&#xE8;res de jugements secondaire sont la mortalit&#xE9; &#xE0; 30 jours et 1an et les complications h&#xE9;morragiques (transfusion, saignement perop&#xE9;ratoire, variation du taux h&#xE9;moglobine pr&#xE9;op&#xE9;ratoire). 
Les patients seront s&#xE9;par&#xE9;s en 3 groupes :
A : Patients trait&#xE9; par AOD op&#xE9;r&#xE9; avant la mise en place du protocole (avant 2023)
B : Patients trait&#xE9; par AOD op&#xE9;r&#xE9; apr&#xE8;s la mise en place du protocole (&#xE0; partir de 2023) 
C :	Patient contr&#xF4;le non anticoagul&#xE9; op&#xE9;r&#xE9; sur la m&#xEA;me p&#xE9;riode

Une premi&#xE8;re analyse statistique descriptive sera r&#xE9;alis&#xE9;e. Les donn&#xE9;es quantitatives sont exprim&#xE9;es par une moyenne et un &#xE9;cart-types. Les donn&#xE9;es qualitatives sont exprim&#xE9;es en nombre et pourcentage.
Pour le crit&#xE8;re de jugement principale nous comparerons le d&#xE9;lais de prise en charge au bloc (exprim&#xE9; en Heures) entre les 3 groupes. Nous pouvons &#xE9;galement comparer la proportion de patient op&#xE9;r&#xE9;s dans les 48 premi&#xE8;res heures suivant leur admission. 
S&#x2019;agissant d&#x2019;une variable quantitative nous utiliserons une analyse de la variance (ANOVA), apr&#xE8;s v&#xE9;rification de l'homog&#xE9;n&#xE9;it&#xE9; des variances (par un test de Bartlett par exemple). Sinon nous utiliserons un test de Kruskal-Wallis. 
Pour les crit&#xE8;res de jugements secondaire, les variable quantitative seront compar&#xE9;es avec les m&#xEA;me test et les variables qualitatives &#xE0; l&#x2019;aide d&#x2019;un Test du Chi2 ou d&#x2019;un Test exact de Fisher en cas d&#x2019;&#xE9;chantillon trop petit. 
Une analyse de survie selon Kaplan-Mayer sera r&#xE9;alis&#xE9; pour la mortalit&#xE9; &#xE0; 30 jours et &#xE0; 1 an. Une comparaison des courbes de survies &#xE0; l&#x2019;aide d&#x2019;un test du Log Rank sera ensuite r&#xE9;alis&#xE9;e. </description_fr>
    <short_description_en></short_description_en>
    <short_description_fr></short_description_fr>
    <creation_datetime>2024-09-05 12:58:58</creation_datetime>
    <update_datetime>2024-09-06 13:29:46</update_datetime>
  </project>
</projects>
