<?xml version="1.0"?>
<projects>
  <project>
    <app_version>0.3.0.9017</app_version>
    <unique_id>3d4f080600ddc576467f6097658493493d93536ba3fa90e1adb50c35eae5050b</unique_id>
    <version>0.0.1.9000</version>
    <authors>
      <author>Kathy CHAPELAIN</author>
      <author>Fabio BOUDIS</author>
      <author>Guillaume PRESSIAT</author>
      <author>Xavier</author>
      <author>Zeynep</author>
      <author>Lucas BOURNEUF</author>
      <author>Gilles</author>
      <author>Pierre</author>
    <authors>
    <name_en>Projet maternit&#xE9;</name_en>
    <name_fr>Projet maternit&#xE9;</name_fr>
    <category_en></category_en>
    <category_fr></category_fr>
    <description_en></description_en>
    <description_fr># Introduction

Les maternit&#xE9;s en France fournissent annuellement des indicateurs d&#x2019;activit&#xE9; essentiels, tels que le nombre de c&#xE9;sariennes, de si&#xE8;ges, de transferts, ou encore le nombre de p&#xE9;ridurales.  

Ces indicateurs, cruciaux pour &#xE9;valuer et am&#xE9;liorer les pratiques obst&#xE9;tricales, sont d&#xE9;riv&#xE9;s des s&#xE9;jours RSS1 (R&#xE9;sum&#xE9; de Sortie Standardis&#xE9;), 
qui reprennent les informations m&#xE9;dicales de chaque patient lors de leur s&#xE9;jour hospitalier produites &#xE0; 
travers plusieurs unit&#xE9;s de soins   

Le challenge de ce datathon r&#xE9;side non seulement dans la cr&#xE9;ation automatis&#xE9;e de ces indicateurs &#xE0; partir des donn&#xE9;es brutes, 
mais aussi dans leur visualisation efficace facilement accessible pour les professionnels de sant&#xE9;.
   
# Mat&#xE9;riel et m&#xE9;thodes

Le datathon organis&#xE9; par l&#x2019;association InterHop.org vise &#xE0; explorer ces aspects en utilisant l&#x2019;outil open-source LinkR, une plateforme permettant la manipulation et l&#x2019;analyse des donn&#xE9;es de sant&#xE9;, tant pour les cliniciens que pour les data scientists.

Pour atteindre les objectifs de ce datathon, plusieurs outils et librairies R et Python seront employ&#xE9;s pour transformer, analyser et visualiser les donn&#xE9;es RSS2.

* Cr&#xE9;ation des indicateurs (&#xE0; partir du format RSS) :   
R : Les librairies dplyr et pmeasyr3 ont &#xE9;t&#xE9; utilis&#xE9;es pour manipuler les donn&#xE9;es, effectuer des filtrages et des agr&#xE9;gations n&#xE9;cessaires pour restructurer les RSS

* Transformation des donn&#xE9;es vers mod&#xE8;le OMOP :   
ETL (Extract, Transform, Load) : des scritps R ont &#xE9;t&#xE9; d&#xE9;velopp&#xE9;s permettant la conversion du format RSS vers OMOP.

* Visualisation des donn&#xE9;es :   
R : ggplot2 pourra &#xEA;tre utilis&#xE9; pour cr&#xE9;er des graphiques clairs et esth&#xE9;tiques des indicateurs, tels que des histogrammes des taux de c&#xE9;sariennes, ou des courbes de survie.

## Ressources   
Jeux de donn&#xE9;es fictif et pseudonymis&#xE9; mis &#xE0; disposition des participant&#x2E31;es

# R&#xE9;sultats  

Le datathon vise &#xE0; impl&#xE9;menter le calcul d&#x2019;indicateurs cl&#xE9;s concernant les activit&#xE9;s des maternit&#xE9;s fran&#xE7;aises, accessibles et interpr&#xE9;tables par les cliniciens, tout en fournissant une base solide pour d&#x2019;autres analyses secondaires. Cette connaissance m&#xE9;tier sera apport&#xE9;e par un m&#xE9;decin responsable d&#x2019;un D&#xE9;partement d&#x2019;Informatique M&#xE9;dical DIM d&#x2019;un h&#xF4;pital fran&#xE7;ais.

Pour exemple l&#x2019;Agence technique de l&#x2019;information sur l&#x2019;hospitalisation (ATIH) met &#xE0; disposition des indicateurs sur l&#x2019;activit&#xE9; hospitali&#xE8;re en p&#xE9;rinatalit&#xE9; produits &#xE0; partir des donn&#xE9;es PMSI (Programme de m&#xE9;dicalisation des syst&#xE8;mes d&#x2019;informations).

Avec ce datathon nous souhaitons proposer

* une am&#xE9;lioration du pilotage de l&#x2019;obst&#xE9;trique aux diff&#xE9;rentes &#xE9;chelles (chu, bassin de soin, r&#xE9;gion&#x2026;), notamment &#xE0; terme avec des visu de donn&#xE9;es historis&#xE9;es et des tendances, coupl&#xE9;e &#xE0; des alertes et des seuils,
* faire ressortir des nouvelles cl&#xE9; de compr&#xE9;hension et d&#x2019;analyse de la MCO notamment pour les parcours MCO complexes

L&#x2019;utilisation de LinkR devrait faciliter la r&#xE9;utilisation de ces indicateurs au sein des services des D&#xE9;partement d&#x2019;Informatique M&#xE9;dical DIM am&#xE9;liorant ainsi la qualit&#xE9; des soins obst&#xE9;tricaux. Nous sou zhaitons aussi d&#xE9;mocratiser l&#x2019;utilisation des donn&#xE9;es et permettre &#xE0; une utilisation plus large aupr&#xE8;s des &#xE9;quipes soignantes.

# Discussion

Les scripts utilis&#xE9;es fonctionnent uniqument dans le cadre de ce challenge, et donc d'une cr&#xE9;ation ex nihilo d'une base OMOP. Une &#xE9;volution n&#xE9;cessaire pour l'int&#xE9;gration dans un ETL de type Airflow est donc d'adapter les script pour qu'ils alimentent une base existante.
Dans le cadre de ce datathon nous aurions beaucoup b&#xE9;n&#xE9;fici&#xE9; d'un outils permettant d'impl&#xE9;menter des patients, des observations, des s&#xE9;jours etc. facilement dans une base OMOP.


</description_fr>
    <short_description_en></short_description_en>
    <short_description_fr>D&#xE9;velopper des outils et indicateurs de suivi des services de maternit&#xE9; </short_description_fr>
    <creation_datetime>2024-09-05 10:33:36</creation_datetime>
    <update_datetime>2024-09-06 21:11:58</update_datetime>
  </project>
</projects>
